app/views/downloads/_releases_info.html.erb

SELECT "locations".* FROM "locations" WHERE ("locations".release_id = 1)
---
	    	<%= f.label :locations, "Locations" %><br />
			<%= rls.locations.map{|loc| truncate(File.basename(loc.location), 35)}[0,3].join("<br/>") if !rls.locations.nil? %>