app/views/downloads/download_release.html.erb

<% @release.locations.each do |loc| %>
---
SELECT "locations".* FROM "locations" WHERE ("locations".release_id = 25)