app/views/albums/_album_peg.html.erb

SELECT "tracks".* FROM "tracks" WHERE ("tracks".album_id = 1) ORDER BY position ASC
---
		<tr>
		<% album.tracks[0..5].each do |t| %>