app/views/albums/_album_list.html.erb

    <td><%= link_to album.artist.name, artist_path(album.artist) %></td>
    <td><%=h album.tracks.length %></td>
---
SELECT "tracks".* FROM "tracks" WHERE ("tracks".album_id = 18) ORDER BY position ASC