app/controllers/albums_controller.rb

  def index
    page = params[:page] || 1
    @albums             = Album.paginate :page => params[:page], :include => [:download], :order => 'albums.created_at DESC', :conditions => ['downloads.approved = ?', true]
    @unapproved_albums  = Album.find(:all, :limit =>15, :include => [:download], :order => 'albums.created_at DESC', :conditions => ['downloads.approved = ?', false])
---
SELECT "downloads".* FROM "downloads" WHERE ("downloads".resource_id = 2 AND "downloads".resource_type = 'Album') LIMIT 1
SELECT COUNT(DISTINCT "albums"."id") AS count_id FROM "albums" LEFT OUTER JOIN "downloads" ON "downloads"."resource_id" = "albums"."id" AND "downloads"."resource_type" = 'Album' WHERE (downloads.approved = 't')
SELECT DISTINCT "albums".id FROM "albums" LEFT OUTER JOIN "downloads" ON "downloads"."resource_id" = "albums"."id" AND "downloads"."resource_type" = 'Album' WHERE (downloads.approved = 't') ORDER BY albums.created_at DESC LIMIT 15 OFFSET 0
SELECT "albums".* FROM "albums" WHERE ("albums"."id" = 2) LIMIT 1
SELECT "downloads".* FROM "downloads" WHERE ("downloads"."id" = 2) LIMIT 1

  def show
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE ("albums"."id" = 23) LIMIT 1

  def edit
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE ("albums"."id" = 1) LIMIT 1