app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" WHERE ("artists"."id" = 12) LIMIT 1
---
  def show
    @artist = Artist.find(params[:id])

SELECT "artists".* FROM "artists" WHERE ("artists"."id" = 12) LIMIT 1
---
  def edit
    @artist = Artist.find(params[:id])