app/controllers/downloads_controller.rb

  def index
    @downloads = Download.paginate :page => params[:page], :include => [ :resource ], :order => 'downloads.created_at DESC', :conditions => ['downloads.approved = ?', false]
---
SELECT "downloads".* FROM "downloads" WHERE (downloads.approved = 'f') ORDER BY downloads.created_at DESC LIMIT 30 OFFSET 0

  def download_release
    @release = Release.find(params[:id])
---
SELECT "releases".* FROM "releases" WHERE ("releases"."id" = 25) LIMIT 1