app/controllers/downloads_controller.rb

  def download_release
    @release = Release.find(params[:id])
    unless (@release.nil? || @release.locations.blank?)
---
SELECT "locations".* FROM "locations" WHERE ("locations".release_id = 25)