app/controllers/invitations_controller.rb

SELECT "invitations".* FROM "invitations" WHERE ("invitations"."sender_id" = 1) LIMIT 30 OFFSET 0
---
  def index
    @invitation = Invitation.new
    @invitations = Invitation.paginate :page => params[:page], :conditions => {:sender_id => current_user}