app/controllers/movies_controller.rb

  def index
    page = params[:page] || 1
    @movies             = Movie.paginate :page => params[:movie_page], :include => [ :download ], :order => 'movies.created_at DESC', :conditions => ['downloads.approved = ?', true]
---
SELECT DISTINCT "movies".id FROM "movies" LEFT OUTER JOIN "downloads" ON "downloads"."resource_id" = "movies"."id" AND "downloads"."resource_type" = 'Movie' WHERE (downloads.approved = 't') ORDER BY movies.created_at DESC LIMIT 15 OFFSET 0

  def show
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE ("movies"."id" = 40) LIMIT 1

  def edit
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE ("movies"."id" = 40) LIMIT 1

  def imdb
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE ("movies"."id" = 40) LIMIT 1

  def imdbfetch
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE ("movies"."id" = 40) LIMIT 1