app/views/releases/_releases_list.erb

SELECT COUNT(*) AS count_id FROM "locations" WHERE ("locations".release_id = 25)
---
		<td><%=h f.release_type.name %></td>
		<td><%=h f.locations.count %></td>